print('user:宝儿妈','context:衣服几天到货啊')
print('\n')
print('--用户画像--\n下单频率:21.56天\n上次下单时间:2019年11月17日\n品类偏好:日用,上衣,箱包\n颜色:白色,黑色\n尺码:M,35\n价格区间:39.0-129.0')
print('\n')
print('--问题画像--\n大类:售后\n小类:物流\n回复:物流')

print('\n')
print('user:春暖花开','context:别再给我发了')
print('\n')
print('--用户画像--\n下单频率:天\n上次下单时间:\n品类偏好:\n颜色:\n尺码:\n价格区间:0.0-100000.0')
print('\n')
print('--问题画像--\n大类:售后\n小类:抱怨\n回复:解释')



print("用户id:865897030655008","您好，我买的商品不合身，可以退货吗？")
print("客服id:2274"," 那我帮您这款申请一下退款哦，但是退款要明天售后处理拉 ")
print("用户id:865897030697547","在吗")
print("客服id:2274"," 亲亲，我是店长微微哦，很高兴为你服务。 ")
print("用户id:865897030485000","你好 我想买几件女王新款衣服")
print("客服id:2274","姐姐，对微微设计的衣服感兴趣的话可以点击上面小程序☝☝☝逛逛我的店铺，也可以看看我朋友圈的，肯定有您喜欢的，有什么问题随时咨询我呀😘😘😘")
print("用户id:A000006ABE910F","这款裙子和图片颜色是一样的吗")
print("客服id:2274"," 姐姐 您放心哦   我们家都是正品的 ")
print("用户id:A000006ABE9BC4","我平时都穿XL的")
print("客服id:2274","直接xL，可以穿哦")
print("用户id:865897030492618","哪一个啊")
print("客服id:2274"," 要麻烦您翻 聊天记录去找下那个链接啦")
print("用户id:865897030489390","有优惠吗")
print("客服id:2274"," 帮您打9折116 ")
print('\n')
print('\n')
print('\n')


print('上衣,新款,姐姐,在吗,女王,裙子,我,裤子,大码,圆通')
print('\n')
print('计算相似度:上衣')
print('裙子 0.765')
print('裤子 0.625')
print('新款 0.102')
print('\n')
print('计算相关度:上衣')
print('新款 0.821')
print('大码 0.673')
print('女王 0.621')





print('\n')
print('\n')
print('{"content":"我想要这件裤子"}\n')
print('商品信息\n新款时尚紧身女牛仔裤直筒裤')
print('价格:89','品类:裤子','三级类目:直筒裤','季节:春,夏,秋')

print('--用户画像--\n下单频率:21.56天\n上次下单时间:2019年11月17日\n品类偏好:日用,上衣,箱包\n颜色:白色,黑色\n尺码:M,35\n价格区间:39.0-129.0')
print('--回复--:根据您的需求和历史订单，和相近身材买家的选择，推荐您选择的sku是 {"颜色":"蓝色","尺码":"XL码"}')
print('\n')
print('{"content":"我最近瘦了10斤，该选多大的呢\微笑"}\n')
print('上下文:{"体重":"-10"}')
print('--回复--:根据您的需求和历史订单，和相近身材买家的选择，推荐您选择的sku是 {"颜色":"蓝色","尺码":"L码"}')





print('\n')
print('\n')
print('{"content":"美女，帮你们家的被套全部发给我看下，要最好的。结婚用的"}\n','场景:询问','大类:售前,偏好','分类:款式','回复类型:推荐')
print('\n')
print('{"content":"给我挑一款有蕾丝边的毛衣裙"}\n','场景:询问','大类:售前,偏好','分类:款式','回复类型:推荐')
print('\n')
print('{"content":"大部分都挺好的吧，但是那件黑色的裙子太透了不合适，想退货可以吗"}\n','场景:询问','大类:售后','分类:退货','回复类型:操作')
